Revit 2027 API
FormattedText.SetAllCapsStatus Method
Overload List
Name | Description
SetAllCapsStatus(Boolean) |  Sets the characters in the entire text to be in all caps or not.
SetAllCapsStatus(TextRange, Boolean) |  Sets the characters in a given text range to be in all caps or not.
Top
See Also
Reference
FormattedText Class
Autodesk.Revit.DB Namespace